Wiznet/WizFi360-EVB-Pico-C/port/WizFi360/src/UART_RP2040.c
/**
 * Copyright (c) 2022 WIZnet Co.,Ltd
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

 
#include "UART_RP2040.h"
#include "RP2040_Device.h"

#define ARM_USART_DRV_VERSION ARM_DRIVER_VERSION_MAJOR_MINOR(1,0)
#define UNUSED(x) (void)(x)           /* macro to get rid of 'unused parameter' warning */

void on_uart_isr(void);

// Driver Version
static const ARM_DRIVER_VERSION usart_driver_version = { ARM_USART_API_VERSION, ARM_USART_DRV_VERSION };

static const ARM_USART_CAPABILITIES Capabilities = {
    1,      ///< supports UART (Asynchronous) mode 
    0,      ///< supports Synchronous Master mode
    0,      ///< supports Synchronous Slave mode
    0,      ///< supports UART Single-wire mode
    0,      ///< supports UART IrDA mode
    0,      ///< supports UART Smart Card mode
    0,      ///< Smart Card Clock generator available
    0,      ///< RTS Flow Control available
    0,      ///< CTS Flow Control available
    0,      ///< Transmit completed event: \ref ARM_USART_EVENT_TX_COMPLETE
    1,      ///< Signal receive character timeout event: \ref ARM_USART_EVENT_RX_TIMEOUT
    0,      ///< RTS Line: 0=not available, 1=available
    0,      ///< CTS Line: 0=not available, 1=available
    0,      ///< DTR Line: 0=not available, 1=available
    0,      ///< DSR Line: 0=not available, 1=available
    0,      ///< DCD Line: 0=not available, 1=available
    0,      ///< RI Line: 0=not available, 1=available
    0,      ///< Signal CTS change event: \ref ARM_USART_EVENT_CTS
    0,      ///< Signal DSR change event: \ref ARM_USART_EVENT_DSR
    0,      ///< Signal DCD change event: \ref ARM_USART_EVENT_DCD
    0       ///< Signal RI change event: \ref ARM_USART_EVENT_RI
#if (defined(ARM_USART_API_VERSION) && (ARM_USART_API_VERSION >= 0x203U))
  , 0U  // Reserved bits
#endif
  };

// UART Run-Time Information
static UART_INFO UART_Info = {
  .cb_event = 0U,
  .status   = {
    .tx_busy          = 0U,
    .rx_busy          = 0U,
    .tx_underflow     = 0U,
    .rx_overflow      = 0U,
    .rx_break         = 0U,
    .rx_framing_error = 0U,
    .rx_parity_error  = 0U
  },
  .flags        = 0U,
  .flow_control = 0U
};

static UART_TRANSFER_INFO UART_TransferInfo = {
  .rx_num      = 0U,
  .tx_num      = 0U,
  .rx_buf      = 0U,
  .tx_buf      = 0U,
  .rx_cnt      = 0U,
  .tx_cnt      = 0U,
  .break_flag  = 0U,
  .send_active = 0U,
  .padding     = {0U, 0U}
};


// UART0
#if USE_UART0
UART_RESOURCES UART0_Resources = {
  .capabilities = Capabilities,
  .reg = uart0,
  .h = (uart_hw_t *)uart0,
  .info = &UART_Info,
  .xfer = &UART_TransferInfo,
  .irq_num = UART0_IRQ

};
#endif

// UART1
#if USE_UART1
UART_RESOURCES UART1_Resources = {
  .capabilities = Capabilities,
  .reg = uart1,
  .h = (uart_hw_t *)uart1,
  .info = &UART_Info,
  .xfer = &UART_TransferInfo,
  .irq_num = UART1_IRQ, 
};

#endif

/**
  \fn          const UART_RESOURCES UART_Resources (UART_HandleTypeDef *huart)
  \brief       Get UART_RESOURCES strusture from UART_HandleTypeDef
*/
static const UART_RESOURCES * UART_Resources (void) {
  const UART_RESOURCES *uart = NULL;

#if USE_UART0
  uart = &UART0_Resources;
#elif USE_UART1
  uart = &UART1_Resources;
#endif
  return uart;
}


// USART Driver functions

/**
  \fn          ARM_DRIVER_VERSION UART_GetVersion (void)
  \brief       Get driver version.
  \return      \ref ARM_DRIVER_VERSION
*/
static ARM_DRIVER_VERSION UART_GetVersion (void) {
  return usart_driver_version;
}

/**
  \fn          ARM_USART_CAPABILITIES UART_GetCapabilities (void)
  \brief       Get driver capabilities
  \param[in]   usart     Pointer to USART resources
  \return      \ref ARM_USART_CAPABILITIES
*/
static ARM_USART_CAPABILITIES UART_GetCapabilities (const UART_RESOURCES *uart) {
  return uart->capabilities;
}

/**
  \fn          int32_t UART_Initialize (      ARM_USART_SignalEvent_t  cb_event
                                         const UART_RESOURCES          *uart)
  \brief       Initialize USART Interface.
  \param[in]   cb_event  Pointer to \ref ARM_USART_SignalEvent
  \param[in]   uart      Pointer to UART resources
  \return      \ref execution_status
*/
static int32_t UART_Initialize (const UART_RESOURCES         *uart,
                                          ARM_USART_SignalEvent_t  cb_event) {

  if (uart->info->flags & UART_FLAG_INITIALIZED) {
    // Driver is already initialized
    return ARM_DRIVER_OK;
  }

  // Clear Status flags
  uart->info->status.tx_busy          = 0U;
  uart->info->status.rx_busy          = 0U;
  uart->info->status.tx_underflow     = 0U;
  uart->info->status.rx_overflow      = 0U;
  uart->info->status.rx_break         = 0U;
  uart->info->status.rx_framing_error = 0U;
  uart->info->status.rx_parity_error  = 0U;

  // Initialize UART Run-time Resources
  uart->info->cb_event = cb_event;

  // Clear transfer information
  memset(uart->xfer, 0, sizeof(UART_TRANSFER_INFO));

  gpio_set_function(UART_TX_PIN, GPIO_FUNC_UART);
  gpio_set_function(UART_RX_PIN, GPIO_FUNC_UART);

  uart->info->flags = UART_FLAG_INITIALIZED;

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t UART_Uninitialize (const UART_RESOURCES *uart)
  \brief       De-initialize UART Interface.
  \param[in]   usart     Pointer to UART resources
  \return      \ref execution_status
*/
static int32_t UART_Uninitialize (const UART_RESOURCES *uart) {

  // Reset UART status flags
  uart->info->flags = 0U;

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t UART_PowerControl (ARM_POWER_STATE state)
  \brief       Control UART Interface Power.
  \param[in]   state  Power state
  \param[in]   usart  Pointer to UART resources
  \return      \ref execution_status
*/
static int32_t UART_PowerControl (const UART_RESOURCES *uart,
                                             ARM_POWER_STATE state) {


  if ((state != ARM_POWER_OFF)  &&
      (state != ARM_POWER_FULL) &&
      (state != ARM_POWER_LOW)) {
    return ARM_DRIVER_ERROR_PARAMETER;
  }

  switch (state) {
    case ARM_POWER_OFF:

      // UART peripheral reset
      NVIC_DisableIRQ(uart->irq_num);
      NVIC_ClearPendingIRQ(uart->irq_num);
      //UART_PeripheralReset (uart->reg);
      uart_deinit (uart->reg);
      uart->info->flags &= ~UART_FLAG_POWERED;

