Wiznet/WizFi360-EVB-Pico-C/port/WizFi360/src/UART_RP2040.c
      // Clear Status flags
      uart->info->status.tx_busy          = 0U;
      uart->info->status.rx_busy          = 0U;
      uart->info->status.tx_underflow     = 0U;
      uart->info->status.rx_overflow      = 0U;
      uart->info->status.rx_break         = 0U;
      uart->info->status.rx_framing_error = 0U;
      uart->info->status.rx_parity_error  = 0U;

      uart->xfer->send_active             = 0U;

      // Clear powered flag
      uart->info->flags &= ~UART_FLAG_POWERED;
      break;
    case ARM_POWER_LOW:
      return ARM_DRIVER_ERROR_UNSUPPORTED;

    case ARM_POWER_FULL:
      // Clear Status flags
      uart->info->status.tx_busy          = 0U;
      uart->info->status.rx_busy          = 0U;
      uart->info->status.tx_underflow     = 0U;
      uart->info->status.rx_overflow      = 0U;
      uart->info->status.rx_break         = 0U;
      uart->info->status.rx_framing_error = 0U;
      uart->info->status.rx_parity_error  = 0U;

      uart->xfer->send_active             = 0U;
      uart->xfer->break_flag              = 0U;

      uart->info->flow_control            = 0U;

      // Set flag initialized
      uart->info->flags = UART_FLAG_POWERED | UART_FLAG_INITIALIZED;

      uart_init (uart->reg, UART_DEFAULT_BAUDRATE);

      // Clear and enable USART IRQ
      NVIC_ClearPendingIRQ(uart->irq_num);
      NVIC_EnableIRQ(uart->irq_num);

      // And set up and enable the interrupt handlers
      irq_set_exclusive_handler(uart->irq_num, on_uart_isr);
      irq_set_enabled(uart->irq_num, true);

      // Now enable the UART to send interrupts - RX only
      uart_set_irq_enables(uart->reg, true, false);


    break;
  }
  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t UART_Send (const void            *data,
                                        uint32_t         num,
                                  const UART_RESOURCES *uart)
  \brief       Start sending data to UART transmitter.
  \param[in]   data  Pointer to buffer with data to send to UART transmitter
  \param[in]   num   Number of data items to send
  \param[in]   usart Pointer to UART resources
  \return      \ref execution_status
*/
static int32_t UART_Send (const UART_RESOURCES *uart,
                             const void           *data,
                                   uint32_t        num) {

  uint32_t event = 0;
  
  if ((data == NULL) || (num == 0U)) {
    // Invalid parameters
    return ARM_DRIVER_ERROR_PARAMETER;
  }

  if ((uart->info->flags & UART_FLAG_CONFIGURED) == 0U) {
    // USART is not configured (mode not selected)
    return ARM_DRIVER_ERROR;
  }

  if (uart->xfer->send_active != 0U) {
    // Send is not completed yet
    return ARM_DRIVER_ERROR_BUSY;
  }

  // Set Send Active flag
  uart->xfer->send_active = 1U;

  // Save transmit buffer info
  uart->xfer->tx_cnt = 0U;
  uart->xfer->tx_num = num;
  uart->xfer->tx_buf = (const uint8_t *)data;

  uart_write_blocking(uart->reg, (const uint8_t *)uart->xfer->tx_buf, uart->xfer->tx_num);
  uart->xfer->tx_buf = NULL;
  uart->xfer->tx_cnt = uart->xfer->tx_num;
  uart->xfer->send_active = 0U;

  event |= ARM_USART_EVENT_SEND_COMPLETE;
  if (uart->info->cb_event != NULL)
    uart->info->cb_event (event);

  return ARM_DRIVER_OK;

}

/**
  \fn          int32_t UART_Receive (      void            *data,
                                           uint32_t         num,
                                     const UART_RESOURCES  *uart)
  \brief       Start receiving data from UART receiver.
  \param[out]  data  Pointer to buffer for data to receive from UART receiver
  \param[in]   num   Number of data items to receive
  \param[in]   usart Pointer to UART resources
  \return      \ref execution_status
*/
static int32_t UART_Receive (const UART_RESOURCES *uart,
                                       void           *data,
                                       uint32_t        num) {
                             
  if ((data == NULL) || (num == 0U)) {
    // Invalid parameters
    return ARM_DRIVER_ERROR_PARAMETER;
  }

  if ((uart->info->flags & UART_FLAG_CONFIGURED) == 0U) {
    // USART is not configured (mode not selected)
    return ARM_DRIVER_ERROR;
  }

  if (uart->info->status.rx_busy == 1U) {
    // Receive operation is not completed yet
    return ARM_DRIVER_ERROR_BUSY;
  }

  // Set receive busy flag
  uart->info->status.rx_busy = 1U;

  // Clear status flags
  uart->info->status.rx_break          = 0U;
  uart->info->status.rx_framing_error  = 0U;
  uart->info->status.rx_overflow       = 0U;
  uart->info->status.rx_parity_error   = 0U;

  // Set receive info
  uart->xfer->rx_cnt =  0U;
  uart->xfer->rx_num = num;
  uart->xfer->rx_buf = (uint8_t *)data;

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t UART_Transfer (const void             *data_out,
                                             void            *data_in,
                                             uint32_t         num,
                                       const UART_RESOURCES  *uart)
  \brief       Start sending/receiving data to/from UART transmitter/receiver.
  \param[in]   data_out  Pointer to buffer with data to send to UART transmitter
  \param[out]  data_in   Pointer to buffer for data to receive from UART receiver
  \param[in]   num       Number of data items to transfer
  \param[in]   uart      Pointer to UART resources
  \return      \ref execution_status
*/
static int32_t UART_Transfer (const UART_RESOURCES *uart,
                                  const void           *data_out,
                                        void           *data_in,
                                        uint32_t        num) {


  UNUSED(data_out);
  UNUSED(data_in);
  UNUSED(num);
  UNUSED(uart);

  // Supported only in Synchronous mode
  return ARM_DRIVER_ERROR;
}

/**
  \fn          uint32_t UART_GetTxCount (const UART_RESOURCES *uart)
  \brief       Get transmitted data count.
  \param[in]   uart     Pointer to UART resources
  \return      number of data items transmitted
*/
static uint32_t UART_GetTxCount (const UART_RESOURCES *uart) {
  return uart->xfer->tx_cnt;
}

/**
  \fn          uint32_t UART_GetRxCount (const UART_RESOURCES *uart)
  \brief       Get received data count.
  \param[in]   uart     Pointer to UART resources
  \return      number of data items received
*/
static uint32_t UART_GetRxCount (const UART_RESOURCES *uart) {
  return uart->xfer->rx_cnt;
}

/**
  \fn          int32_t UART_Control (      uint32_t          control,
                                           uint32_t          arg,
                                      const UART_RESOURCES  *uart)
  \brief       Control UART Interface.
  \param[in]   control  Operation
  \param[in]   arg      Argument of operation (optional)
  \param[in]   uart    Pointer to UART resources
  \return      common \ref execution_status and driver specific \ref uart_execution_status
*/
static int32_t UART_Control (const UART_RESOURCES *uart,
                                       uint32_t        control,
                                       uint32_t        arg) {
  uint32_t mode;
  uint32_t uart_data_bits, uart_parity, uart_stopbits;
  uint8_t uart_rts, uart_cts;

  uart_data_bits = 0;
  uart_parity = 0;
  uart_stopbits = 0;
  uart_rts = 0;
  uart_cts = 0;

  if (control & (1U << 4)) {
    // USART Miscellaneous Operations
    switch (control & ARM_USART_CONTROL_Msk) {
      case ARM_USART_SET_DEFAULT_TX_VALUE:       // Set default Transmit value (Synchronous Receive only); arg = value
        return ARM_DRIVER_ERROR_UNSUPPORTED;

      case ARM_USART_SET_IRDA_PULSE:             // Set IrDA Pulse in ns; arg: 0=3/16 of bit period
        return ARM_DRIVER_ERROR_UNSUPPORTED;

