Wiznet/WizFi360-EVB-Pico-C/port/WizFi360/src/UART_RP2040.c
      case ARM_USART_SET_SMART_CARD_GUARD_TIME:  // Set Smart Card Guard Time; arg = number of bit periods
        return ARM_DRIVER_ERROR_UNSUPPORTED;

      case ARM_USART_SET_SMART_CARD_CLOCK:       // Set Smart Card Clock in Hz; arg: 0=Clock not generated
        return ARM_DRIVER_ERROR_UNSUPPORTED;

      case ARM_USART_CONTROL_SMART_CARD_NACK:    // Smart Card NACK generation; arg: 0=disabled, 1=enabled
        return ARM_DRIVER_ERROR_UNSUPPORTED;

      case ARM_USART_CONTROL_TX:                 // Transmitter; arg: 0=disabled, 1=enabled
        if (arg == 0U) {
          // Disable UART transmitter
          hw_clear_bits(&uart->h->cr, UART_UARTCR_TXE_BITS);
          uart->info->flags &= ~UART_FLAG_TX_ENABLED;
        }
        else {
          hw_set_bits(&uart->h->cr, UART_UARTCR_TXE_BITS);
          uart->info->flags |= UART_FLAG_TX_ENABLED;
        }
        return ARM_DRIVER_OK;

      case ARM_USART_CONTROL_RX:                 // Receiver; arg: 0=disabled, 1=enabled
        // Check if RX line available
        if (arg == 0U) {
          // Disable USART receive and receive interrupt
          uart_set_irq_enables(uart->reg, false, false);

          // Disable USART receiver
          hw_clear_bits(&uart->h->cr, UART_UARTCR_RXE_BITS);
          uart->info->flags &= ~UART_FLAG_RX_ENABLED;
        }
        else {
          // Enable USART receiver
          hw_set_bits(&uart->h->cr, UART_UARTCR_RXE_BITS);

          // Enable USART receive and receive timeout interrupt
          uart_set_irq_enables(uart->reg, true, false);
          uart->info->flags |= UART_FLAG_RX_ENABLED;
        }
        return ARM_DRIVER_OK;

      case ARM_USART_CONTROL_BREAK:              // Continuous Break transmission; arg: 0=disabled, 1=enabled
        return ARM_DRIVER_ERROR_UNSUPPORTED;
      case ARM_USART_ABORT_SEND:                 // Abort ARM_USART_Send
        // Clear transfer info
        uart->xfer->tx_buf = NULL;
        uart->xfer->tx_num = 0U;
        uart->xfer->tx_cnt = 0U;

        // Clear Send Active flag
        uart->xfer->send_active = 0U;

        return ARM_DRIVER_OK;

      case ARM_USART_ABORT_RECEIVE:              // Abort ARM_USART_Receive
        // Clear transfer info
        uart->xfer->rx_buf = NULL;
        uart->xfer->rx_num = 0;
        uart->xfer->rx_cnt = 0;

        // Clear RX Busy status
        uart->info->status.rx_busy = 0U;

        return ARM_DRIVER_OK;

      case ARM_USART_ABORT_TRANSFER:             // Abort ARM_USART_Transfer
        // Transfer not implemented
        return ARM_DRIVER_ERROR;

      default: 
        return ARM_DRIVER_ERROR;
    }
  } else {
    // USART Mode

    if ((uart->info->status.rx_busy != 0U) || (uart->xfer->send_active != 0U)) {
      // Receive or send operation in progress
      return ARM_DRIVER_ERROR_BUSY;
    }

    switch (control & ARM_USART_CONTROL_Msk) {
      case ARM_USART_MODE_ASYNCHRONOUS:          // UART (Asynchronous); arg = Baudrate
        //mode = ARM_USART_MODE_ASYNCHRONOUS;    
        uart_init(uart->reg, UART_DEFAULT_BAUDRATE);
        uart_set_fifo_enabled(uart->reg, true);
        break;

      case ARM_USART_MODE_SYNCHRONOUS_MASTER:    // Synchronous Master (generates clock signal); arg = Baudrate
        return ARM_DRIVER_ERROR_UNSUPPORTED;

      case ARM_USART_MODE_SYNCHRONOUS_SLAVE:     // Synchronous Slave (external clock signal)
        return ARM_DRIVER_ERROR_UNSUPPORTED;

      case ARM_USART_MODE_SINGLE_WIRE:           // UART Single-wire (half-duplex); arg = Baudrate
        return ARM_DRIVER_ERROR_UNSUPPORTED;

      case ARM_USART_MODE_IRDA:                  // UART IrDA; arg = Baudrate
        return ARM_DRIVER_ERROR_UNSUPPORTED;

      case ARM_USART_MODE_SMART_CARD:            // UART Smart Card; arg = Baudrate
        return ARM_DRIVER_ERROR_UNSUPPORTED;

      default:
        return ARM_DRIVER_ERROR;
    }

    // Data Bits
    switch (control & ARM_USART_DATA_BITS_Msk) {
      case ARM_USART_DATA_BITS_5:
        break;
      case ARM_USART_DATA_BITS_6:
          uart_data_bits = 6;
          hw_write_masked(&uart->h->lcr_h,
                         ((uart_data_bits - 5u) << UART_UARTLCR_H_WLEN_LSB),
                         UART_UARTLCR_H_WLEN_BITS);
        break;
      case ARM_USART_DATA_BITS_7:
          uart_data_bits = 7;
          hw_write_masked(&uart->h->lcr_h,
                         ((uart_data_bits - 5u) << UART_UARTLCR_H_WLEN_LSB),
                         UART_UARTLCR_H_WLEN_BITS);

        break;
      case ARM_USART_DATA_BITS_8:
          uart_data_bits = 8;
          hw_write_masked(&uart->h->lcr_h,
                         ((uart_data_bits - 5u) << UART_UARTLCR_H_WLEN_LSB),
                         UART_UARTLCR_H_WLEN_BITS);

        break;
      default:  return ARM_USART_ERROR_DATA_BITS;
    }

    // Parity Bit
    switch (control & ARM_USART_PARITY_Msk) {
      case ARM_USART_PARITY_NONE:
        uart_parity = UART_PARITY_NONE;
        hw_write_masked(&uart->h->lcr_h,
                       (bool_to_bit(uart_parity != UART_PARITY_NONE) << UART_UARTLCR_H_PEN_LSB) |
                       (bool_to_bit(uart_parity == UART_PARITY_EVEN) << UART_UARTLCR_H_EPS_LSB),
                        UART_UARTLCR_H_PEN_BITS |
                        UART_UARTLCR_H_EPS_BITS);
        break;
      case ARM_USART_PARITY_ODD:
        uart_parity = UART_PARITY_ODD;
        hw_write_masked(&uart->h->lcr_h,
               (bool_to_bit(uart_parity != UART_PARITY_NONE) << UART_UARTLCR_H_PEN_LSB) |
               (bool_to_bit(uart_parity == UART_PARITY_EVEN) << UART_UARTLCR_H_EPS_LSB),
                UART_UARTLCR_H_PEN_BITS |
                UART_UARTLCR_H_EPS_BITS);
        break;
      case ARM_USART_PARITY_EVEN:
        uart_parity = UART_PARITY_EVEN;
        hw_write_masked(&uart->h->lcr_h,
                       (bool_to_bit(uart_parity != UART_PARITY_NONE) << UART_UARTLCR_H_PEN_LSB) |
                       (bool_to_bit(uart_parity == UART_PARITY_EVEN) << UART_UARTLCR_H_EPS_LSB),
                        UART_UARTLCR_H_PEN_BITS |
                        UART_UARTLCR_H_EPS_BITS);

        break;
      default: return ARM_USART_ERROR_PARITY;
    }

    // Stop Bit
    switch (control & ARM_USART_STOP_BITS_Msk) {
      case ARM_USART_STOP_BITS_1:
        uart_stopbits = 1;
        hw_write_masked(&uart->h->lcr_h,
                       ((uart_stopbits - 1u) << UART_UARTLCR_H_STP2_LSB),
                       UART_UARTLCR_H_STP2_BITS);
        break;
      case ARM_USART_STOP_BITS_2:
        uart_stopbits = 2;
        hw_write_masked(&uart->h->lcr_h,
                       ((uart_stopbits - 1u) << UART_UARTLCR_H_STP2_LSB),
                       UART_UARTLCR_H_STP2_BITS);
        break;
      default: return ARM_USART_ERROR_STOP_BITS;
    }

    // Flow Control
    switch (control & ARM_USART_FLOW_CONTROL_Msk) {
      case ARM_USART_FLOW_CONTROL_NONE:
        gpio_set_function(UART_RTS_PIN, GPIO_FUNC_NULL);
        gpio_set_function(UART_CTS_PIN, GPIO_FUNC_NULL);
        uart_rts = 0;
        uart_cts = 0;
        hw_write_masked(&uart->h->cr,
                       (bool_to_bit(uart_cts) << UART_UARTCR_CTSEN_LSB) | (bool_to_bit(uart_rts) << UART_UARTCR_RTSEN_LSB),
                       UART_UARTCR_RTSEN_BITS | UART_UARTCR_CTSEN_BITS);
        break;

      case ARM_USART_FLOW_CONTROL_RTS:        
#if (UART_RTS_PIN)
        gpio_set_function(UART_RTS_PIN, GPIO_FUNC_UART);
        gpio_set_function(UART_CTS_PIN, GPIO_FUNC_NULL);
        uart_rts = 1;
        uart_cts = 0;
        hw_write_masked(&uart->h->cr,
                       (bool_to_bit(uart_cts) << UART_UARTCR_CTSEN_LSB) | (bool_to_bit(uart_rts) << UART_UARTCR_RTSEN_LSB),
                       UART_UARTCR_RTSEN_BITS | UART_UARTCR_CTSEN_BITS);
        break;
#else
        return ARM_USART_ERROR_FLOW_CONTROL;
#endif

