Wiznet/WizFi360-EVB-Pico-C/port/WizFi360/src/UART_RP2040.c
      case ARM_USART_FLOW_CONTROL_CTS:
#if (UART_CTS_PIN)
        gpio_set_function(UART_RTS_PIN, GPIO_FUNC_NULL);
        gpio_set_function(UART_CTS_PIN, GPIO_FUNC_UART);
        uart_rts = 0;
        uart_cts = 1;
        hw_write_masked(&uart->h->cr,
                       (bool_to_bit(uart_cts) << UART_UARTCR_CTSEN_LSB) | (bool_to_bit(uart_rts) << UART_UARTCR_RTSEN_LSB),
                       UART_UARTCR_RTSEN_BITS | UART_UARTCR_CTSEN_BITS);

#else
        return ARM_USART_ERROR_FLOW_CONTROL;
#endif
      case ARM_USART_FLOW_CONTROL_RTS_CTS:
#if (UART_RTS_PIN && UART_CTS_PIN)
        gpio_set_function(UART_RTS_PIN, GPIO_FUNC_UART);
        gpio_set_function(UART_CTS_PIN, GPIO_FUNC_UART);
        uart_rts = 1;
        uart_cts = 1;
        hw_write_masked(&uart->h->cr,
                       (bool_to_bit(uart_cts) << UART_UARTCR_CTSEN_LSB) | (bool_to_bit(uart_rts) << UART_UARTCR_RTSEN_LSB),
                       UART_UARTCR_RTSEN_BITS | UART_UARTCR_CTSEN_BITS);

        break;
#else
        return ARM_USART_ERROR_FLOW_CONTROL;
#endif

      default: return ARM_USART_ERROR_FLOW_CONTROL;
    }
    // Configuration is valid, apply setti
    // Setup baud rate dividers
    uart_set_baudrate(uart->reg, arg);

    // Set configured flag
    uart->info->flags |= UART_FLAG_CONFIGURED;
  }
  
  return ARM_DRIVER_OK;
}


/**
  \fn          ARM_USART_STATUS UART_GetStatus (const UART_RESOURCES *uart)
  \brief       Get UART status.
  \param[in]   uart     Pointer to UART resources
  \return      UART status \ref ARM_UART_STATUS
*/
static ARM_USART_STATUS UART_GetStatus (const UART_RESOURCES *uart) {
  ARM_USART_STATUS uart_status;

  if (uart->xfer->send_active != 0U) {
    uart_status.tx_busy        = 1U;
  } else {
    //status.tx_busy        = ((usart->reg->FR & UART_FR_BUSY_Msk) ? (1U) : (0U));
  }

  uart_status.rx_busy          = uart->info->status.rx_busy;
  uart_status.tx_underflow     = uart->info->status.tx_underflow;
  uart_status.rx_overflow      = uart->info->status.rx_overflow;
  uart_status.rx_break         = uart->info->status.rx_break;
  uart_status.rx_framing_error = uart->info->status.rx_framing_error;
  uart_status.rx_parity_error  = uart->info->status.rx_parity_error;

  return uart_status;

}

/**
  \fn          int32_t UART_SetModemControl (const UART_RESOURCES         *uart,
                                                    ARM_USART_MODEM_CONTROL  control)
  \brief       Set UART Modem Control line state.
  \param[in]   usart     Pointer to UART resources
  \param[in]   control   \ref ARM_UART_MODEM_CONTROL
  \return      \ref execution_status
*/
static int32_t UART_SetModemControl (const UART_RESOURCES                *uart,
                                                 ARM_USART_MODEM_CONTROL control) {

  (void) control;

  // No modem control in synchronous mode
  return ARM_DRIVER_ERROR;

}


/**
  \fn          ARM_UART_MODEM_STATUS UART_GetModemStatus (void)
  \brief       Get UART Modem Status lines state.
  \return      modem status \ref ARM_UART_MODEM_STATUS
*/
static ARM_USART_MODEM_STATUS UART_GetModemStatus (const UART_RESOURCES *uart) {
  ARM_USART_MODEM_STATUS modem_status;

  modem_status.cts = 0U;
  modem_status.dsr = 0U;
  modem_status.ri  = 0U;
  modem_status.dcd = 0U;

  return modem_status;
}

void on_uart_isr(void){
  UART_RESOURCES * uart = UART_Resources();
  uint32_t event = 0U;

  // Check for errors
  if ((uart->h->ris & UART_UARTRIS_OERIS_BITS) != 0U) {
    // Overrun error
    uart->info->status.rx_overflow = 1U;
    event |= ARM_USART_EVENT_RX_OVERFLOW;
    hw_set_bits(&uart->h->icr, UART_UARTICR_OEIC_BITS);
  }
  
  if((uart->h->ris & UART_UARTRIS_BERIS_BITS) != 0U) {
    // Break error
    uart->info->status.rx_break = 1U;
    event |= ARM_USART_EVENT_RX_BREAK;
    hw_set_bits(&uart->h->icr, UART_UARTICR_BEIC_BITS);
  }
  
  if ((uart->h->ris & UART_UARTRIS_PERIS_BITS) != 0U) {
    uart->info->status.rx_parity_error = 1U;
    event |= ARM_USART_EVENT_RX_PARITY_ERROR;
    hw_set_bits(&uart->h->icr, UART_UARTICR_PEIC_BITS);
  }
  
  if ((uart->h->ris & UART_UARTRIS_FERIS_BITS) != 0U) {
    uart->info->status.rx_framing_error = 1U;
    event |= ARM_USART_EVENT_RX_FRAMING_ERROR;
    hw_set_bits(&uart->h->icr, UART_UARTICR_FEIC_BITS);
  }

  if ((uart->h->ris & UART_UARTRIS_RTRIS_BITS) != 0U) {
//    uart->info->status.rx_framing_error = 1U;
    //event |= ARM_USART_EVENT_RX_FRAMING_ERROR;
    hw_set_bits(&uart->h->icr, UART_UARTICR_RTIC_BITS);
  }

  if (uart->xfer->rx_buf != NULL) {
    if (uart_is_readable(uart->reg)) {
      uart->xfer->rx_buf[uart->xfer->rx_cnt++] = (uint8_t)uart_getc(uart->reg);
    }
    if (uart->xfer->rx_cnt == uart->xfer->rx_num)
    {
      // Receive operation is completed
      uart->xfer->rx_buf = NULL;
      uart->info->status.rx_busy = 0U;
      // Signal receive complete
      event |= ARM_USART_EVENT_RECEIVE_COMPLETE;
    }
  }
  else {  
    // Current byte is lost, send overflow event
    event |= ARM_USART_EVENT_RX_OVERFLOW;
  }

  if (event != 0U){
    // Signal error event
    if (uart->info->cb_event != NULL) {
      uart->info->cb_event (event);
    }
    event = 0U;
  }
}


// USART0 Driver Wrapper functions
#if USE_UART0
static ARM_USART_CAPABILITIES  UART0_GetCapabilities (void)                                                { return UART_GetCapabilities (&UART0_Resources);                         }
static int32_t                 UART0_Initialize      (ARM_USART_SignalEvent_t cb_event)                    { return UART_Initialize      (&UART0_Resources, cb_event);               }
static int32_t                 UART0_Uninitialize    (void)                                                { return UART_Uninitialize    (&UART0_Resources);                         }
static int32_t                 UART0_PowerControl    (ARM_POWER_STATE state)                               { return UART_PowerControl    (&UART0_Resources, state);                  }
static int32_t                 UART0_Send            (const void *data, uint32_t num)                      { return UART_Send            (&UART0_Resources, data, num);              }
static int32_t                 UART0_Receive         (void *data, uint32_t num)                            { return UART_Receive         (&UART0_Resources, data, num);              }
static int32_t                 UART0_Transfer        (const void *data_out, void *data_in, uint32_t num)   { return UART_Transfer        (&UART0_Resources, data_out, data_in, num); }
static uint32_t                UART0_GetTxCount      (void)                                                { return UART_GetTxCount      (&UART0_Resources);                         }
static uint32_t                UART0_GetRxCount      (void)                                                { return UART_GetRxCount      (&UART0_Resources);                         }
static int32_t                 UART0_Control         (uint32_t control, uint32_t arg)                      { return UART_Control         (&UART0_Resources, control, arg);           }
static ARM_USART_STATUS        UART0_GetStatus       (void)                                                { return UART_GetStatus       (&UART0_Resources);                         }
static int32_t                 UART0_SetModemControl (ARM_USART_MODEM_CONTROL control)                     { return UART_SetModemControl (&UART0_Resources, control);                }
static ARM_USART_MODEM_STATUS  UART0_GetModemStatus  (void)                                                { return UART_GetModemStatus  (&UART0_Resources);                         }

