Wiznet/WizFi360-EVB-Pico-C/port/WizFi360/src/UART_RP2040.c
// USART1 Driver Control Block
extern ARM_DRIVER_USART Driver_USART0;
       ARM_DRIVER_USART Driver_USART0 = {
    UART_GetVersion,
    UART0_GetCapabilities,
    UART0_Initialize,
    UART0_Uninitialize,
    UART0_PowerControl,
    UART0_Send,
    UART0_Receive,
    UART0_Transfer,
    UART0_GetTxCount,
    UART0_GetRxCount,
    UART0_Control,
    UART0_GetStatus,
    UART0_SetModemControl,
    UART0_GetModemStatus
};
#endif

// USART1 Driver Wrapper functions
#if USE_UART1
static ARM_USART_CAPABILITIES  UART1_GetCapabilities (void)                                                { return UART_GetCapabilities (&UART1_Resources);                         }
static int32_t                 UART1_Initialize      (ARM_USART_SignalEvent_t cb_event)                    { return UART_Initialize      (&UART1_Resources, cb_event);               }
static int32_t                 UART1_Uninitialize    (void)                                                { return UART_Uninitialize    (&UART1_Resources);                         }
static int32_t                 UART1_PowerControl    (ARM_POWER_STATE state)                               { return UART_PowerControl    (&UART1_Resources, state);                  }
static int32_t                 UART1_Send            (const void *data, uint32_t num)                      { return UART_Send            (&UART1_Resources, data, num);              }
static int32_t                 UART1_Receive         (void *data, uint32_t num)                            { return UART_Receive         (&UART1_Resources, data, num);              }
static int32_t                 UART1_Transfer        (const void *data_out, void *data_in, uint32_t num)   { return UART_Transfer        (&UART1_Resources, data_out, data_in, num); }
static uint32_t                UART1_GetTxCount      (void)                                                { return UART_GetTxCount      (&UART1_Resources);                         }
static uint32_t                UART1_GetRxCount      (void)                                                { return UART_GetRxCount      (&UART1_Resources);                         }
static int32_t                 UART1_Control         (uint32_t control, uint32_t arg)                      { return UART_Control         (&UART1_Resources, control, arg);           }
static ARM_USART_STATUS        UART1_GetStatus       (void)                                                { return UART_GetStatus       (&UART1_Resources);                         }
static int32_t                 UART1_SetModemControl (ARM_USART_MODEM_CONTROL control)                     { return UART_SetModemControl (&UART1_Resources, control);                }
static ARM_USART_MODEM_STATUS  UART1_GetModemStatus  (void)                                                { return UART_GetModemStatus  (&UART1_Resources);                         }

// USART1 Driver Control Block
extern ARM_DRIVER_USART Driver_USART1;
       ARM_DRIVER_USART Driver_USART1 = {
    UART_GetVersion,
    UART1_GetCapabilities,
    UART1_Initialize,
    UART1_Uninitialize,
    UART1_PowerControl,
    UART1_Send,
    UART1_Receive,
    UART1_Transfer,
    UART1_GetTxCount,
    UART1_GetRxCount,
    UART1_Control,
    UART1_GetStatus,
    UART1_SetModemControl,
    UART1_GetModemStatus
};

#endif



